app/views/posts/_form.html.erb

    <%= f.label :user %><br/>
    <%= f.select :user_id, options_for_select(@users.map { |user| [user.name, user.id]}, @post.user_id) %>
---
SELECT "users".* FROM "users"