app/views/posts/show.html.erb

SELECT "images".* FROM "images" WHERE "images"."post_id" = ?  [["post_id", 1]]
---
    <tbody>
      <% @post.images.each do |picture| %>

SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---

<%= link_to pluralize(@post.comments.size, 'comment'), post_comments_path(@post) %> |