app/controllers/comments_controller.rb

INSERT INTO "comments" ("comment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["comment", "TEst"], ["post_id", 1], ["created_at", "2015-02-07 01:56:47.199974"], ["updated_at", "2015-02-07 01:56:47.199974"]]
---
  def create
    @comment = @post.comments.new(comment_params)

    respond_to do |format|
      if @comment.save

UPDATE "comments" SET "comment" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["comment", "test1234"], ["updated_at", "2015-02-07 03:11:53.495778"], ["id", 7]]
---
  def update
    respond_to do |format|
      if @comment.update(comment_params)

DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
  def destroy
    @post = @comment.post
    @comment.destroy

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy_all
    @post = Post.find(params[:post_id])
    @post.comments.destroy_all