app/controllers/images_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @image = @post.images.new(image_params)
    if @image.save
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "images" ("attachment", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["attachment", "StitchPics_1.png"], ["post_id", 1], ["created_at", "2015-02-07 21:16:48.247925"], ["updated_at", "2015-02-07 21:16:48.247925"]]

  def destroy
    @image = Image.find(params[:id])
    @post = @image.post
    @image.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT 1  [["id", 4]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 4]]