app/controllers/posts_controller.rb

  def create
    get_all_users
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Testing post"], ["content", "hello there!"], ["user_id", 2], ["created_at", "2015-02-06 21:16:19.437721"], ["updated_at", "2015-02-06 21:16:19.437721"]]

  def update
    respond_to do |format|
      if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "user_id" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "xyz"], ["content", "xyzzz"], ["user_id", 1], ["updated_at", "2015-02-09 03:48:39.107686"], ["id", 2]]